package com.axon.java.stack.data.structures.binary.tree.avl.tree;

/**
 *  添加平衡二叉树
 *
 * 案例一：
 *  int []  arr={4,3,6,5,7,8}
 *  构建成一个排序二叉树，如图所示：
 *          4
 *        /   \
 *       3     6
 *            / \
 *           5   7
 *                \
 *                 8
 *  将排序二叉树构建成一个平衡二叉树，如图所示：
 *
 *
 *  案例二
 *   int [] arr= {10, 11, 7, 6, 8, 9}
 *   构建成一个排序二叉树，如图所示：
 *
 *        10
 *       /  \
 *      7   11
 *     / \
 *    6   8
 *         \
 *          9
 *   将排序二叉树构建成一个平衡二叉树，如图所示：
 *
 *
 *
 *
 * 案例三
 *  int [] arr = {2, 1, 6, 5, 7, 3}
 *  构建成一个排序二叉树，如图所示：
 *
 *        2
 *       / \
 *      1   6
 *         / \
 *        5   7
 *       /
 *      3
 *将排序二叉树构建成一个平衡二叉树，如图所示：
 *         5
 *       / \
 *      2   6
 *     / \    \
 *    1   3    7
 *
 *
 */
public class AVLTreeDemo {

    public static void main(String[] args) {

    }
}
